Конфигурация/src/Documents/ОплатаПроживания/ОплатаПроживания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОплатаПроживания</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоБроням</registerRecords>
  <registerRecords>InformationRegister.БронированиеНомеров</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПоУслугам</registerRecords>
  <attributes>
    <name>Бронь</name>
    <type>
      <types>DocumentRef.БронированиеНомера</types>
    </type>
  </attributes>
  <attributes>
    <name>Гость</name>
    <type>
      <types>CatalogRef.Гости</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОплаты</name>
    <comment>Сколько заплатил гость</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособОплаты</name>
    <type>
      <types>EnumRef.СпособыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Услуги</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/InformationRegisters/СтоимостьУслуг/СтоимостьУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтоимостьУслуг</name>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <dimensions>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Конфигурация/src/Documents/ОплатаПроживания/Forms/ФормаОплатаПроживания/Module.bsl
&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
    
    ТекущаяСтрока = Элементы.Услуги.ТекущиеДанные;
    
    Если ТекущаяСтрока = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
    
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
    
    ТекущаяСтрока = Элементы.Услуги.ТекущиеДанные;
    
    Если ТекущаяСтрока = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
    
КонецПроцедуры
&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)
    
    
    ТекущаяСтрока = Элементы.Услуги.ТекущиеДанные;
    
    Если ТекущаяСтрока = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Услуга) Тогда
        Возврат;
    КонецЕсли;
    
    
    // Вызываем сервер для получения цены
    Цена = ПолучитьЦенуУслуги(ТекущаяСтрока.Услуга, Объект.Дата);
    
    
    ТекущаяСтрока.Цена = Цена;
    
    // Пересчитываем сумму
    Если ТекущаяСтрока.Количество > 0 Тогда
        ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
    КонецЕсли;
    
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦенуУслуги(Услуга, Дата)
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |    СтоимостьУслуг.Стоимость КАК Стоимость
        |ИЗ
        |    РегистрСведений.СтоимостьУслуг.СрезПоследних(&Дата, Услуга = &Услуга) КАК СтоимостьУслуг";
    
    Запрос.УстановитьПараметр("Дата", Дата);
    Запрос.УстановитьПараметр("Услуга", Услуга);
    
    Результат = Запрос.Выполнить().Выбрать();
    
    Если Результат.Следующий() Тогда
        Возврат Результат.Стоимость;
    Иначе
        Возврат 0;
    КонецЕсли;
    
КонецФункции
&НаКлиенте
Процедура БроньПриИзменении(Элемент)
    // Как только выбрали бронь, сами подставляем клиента из неё
    ДанныеБрони = ПолучитьДанныеБрониНаСервере(Объект.Бронь);
    Объект.Гость = ДанныеБрони.Гость;
    // Можно сразу и сумму подставить (остаток долга), если хочешь
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеБрониНаСервере(БроньСсылка)
    Результат = Новый Структура("Гость");
    // Здесь предполагается, что в Бронировании поле называется "ОсновнойГость" или "Клиент"
    Результат.Гость = БроньСсылка.ОсновнойГость; 
    Возврат Результат;
КонецФункции
